In [1]:
import numpy as np
import pandas as pd

# Create 3 differents Series, each of length 100, as follows:

In [2]:
n1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
n2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
n3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(n1, n2, n3)

0     4
1     2
2     2
3     1
4     1
     ..
95    4
96    1
97    1
98    2
99    2
Length: 100, dtype: int32 0     2
1     1
2     3
3     1
4     2
     ..
95    2
96    1
97    3
98    1
99    2
Length: 100, dtype: int32 0     14765
1     29189
2     10239
3     16260
4     26299
      ...
95    23960
96    10902
97    21365
98    23054
99    14242
Length: 100, dtype: int32

# Let's create a DataFrame by joinning the Series by column

In [3]:
n = pd.concat([n1, n2, n3], axis=1)
n.head()

   0  1      2
0  4  2  14765
1  2  1  29189
2  2  3  10239
3  1  1  16260
4  1  2  26299

# Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
n.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
n.head()

   bedrs  bathrs  price_sqr_meter
0      4       2            14765
1      2       1            29189
2      2       3            10239
3      1       1            16260
4      1       2            26299

# Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [6]:
bigcolumn = pd.concat([n1, n2, n3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       4
1       2
2       2
3       1
4       1
..    ...
95  23960
96  10902
97  21365
98  23054
99  14242

[300 rows x 1 columns]

# Oops, it seems it is going only until index 99. Is it true?

In [7]:
len(bigcolumn)

300

# Reindex the DataFrame so it goes from 0 to 299¶

In [8]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        4
1        2
2        2
3        1
4        1
..     ...
295  23960
296  10902
297  21365
298  23054
299  14242

[300 rows x 1 columns]